//   Falsy მნიშვნელობები:
//   ეს არის მნიშვნელობები, რომლებიც პირობაში (if-ში) გარდაიქმნება false-ად.
//   სულ არის 6 ძირითადი falsy მნიშვნელობა:
//   1. false (თავად ბულიანი)
//   2. 0 (ნული)
//   3. "" (ცარიელი სტრინგი)
//   4. null (მნიშვნელობის არარსებობა)
//   5. undefined (მიუნიჭებელი მნიშვნელობა)
//   6. NaN (Not a Number - არარიცხვი)

//   Truthy მნიშვნელობები:
//   ყველაფერი დანარჩენი, რაც არ არის falsy, არის truthy.
//   მაგალითად: "0" (სტრინგი), "false" (სტრინგი), [] (ცარიელი მასივი), {} (ცარიელი ობიექტი), 25 და ა.შ.
