// 1)შექმენით ერთი სეტი სადაც მოათავსებთ რამდენიმე ელემენტს(ერთნაირი ელემენტები მეორდებოდეს რამდენჯერმე)

// შენი დავალებაა რომ სეტში დაამატო რამდენიმე განსხვავებული ელემენტი(გამოიყენე CHAIN + მეთოდი)

// შემდეგ ამოშალე ის ელემენტი სეტიდან რომელიც პირველია სეტში

// შემდეგ შეამოწმე არის თუ არა თქვენთვის სასურველი ელემენტი სეტში

// შემდეგ კონსოლში გამოიტანე სეტის სიგრძე

// შემდეგ შექმენი ცვლადი და გამოიყენე ENTRIES მეთოდი სეტზე,ამის შემდეგ გადაუარე FOREACH ით და გამოიტანე წყვილად(სიებად)

// ამის შემდეგ გაასუფთავეთ მთლიანი სეტი

let set = new Set([
  1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 1, 2, 3, 4, 5,
  6, 7, 8, 9, 10,
]);

set.add(11).add(12).add(13).add(14).add(15);

console.log(set);

set.delete(1);

console.log(set);

console.log(set.has(11));

console.log(set.size);

let set2 = set.entries();

set2.forEach((value) => {
    console.log(value);
});

set.clear();

console.log(set);
