//4)მომხმარებელს შემოატანინეთ სტრინგი,სანამ მომხმარებელი არ შემოიტანს თქვენს სახელს იქამდე გაუმეორეთ რომ თავიდან შემოიყვანოს სახელი,ასევე დაითვალეთ ცდების რაოდენობა თუ რამდენჯერ სცადა მომხმარებელმა შემოტანა,ამისთვის დაგჭრდებათ თავიდან შექმნათ ცვლადი და გაუტოლოთ 0 ს,და ყოველ ჯერზე როცა მომხმარებელი შეიყვანს არასწორ ინფოს განაახლოთ ამ ცვლადის მნიშვნელობა,ბოლოს როცა გაარტყავს და შემოიყვანს თქვენს სახელს დაუკონსოლლოგეთ --> "you guessed my name and your attempts is : ...
let trys = 0;

while (true) {
  let name = prompt("enter name");
  if (name == "nika") {
    console.log("you guessed my name and your attempts is :", name);
    break;
  } else {
    console.log("try again");
    trys++
  }
}
