// შექმენით ფრომისი რომელშიც

// შექმნით ცვლადს სადაც იქნება შენახული რაიმე სახელი

// შენი დავალებაა შეამოწმო თუ სახელი იწყება ასო "a" ზე ან ასო "g" ზე

// მაშინ დაარესოლვე ფრომისი და რესოლვს გაატანე ის სახელი რაც ცვლადში გაქვს შენახული

// სხვა შემთხვევაში დაარეჯექთე ფრომისი და ერორად გაატანე რაიმე ტექსტური ერორი

// , შემდეგ გამოიძახე ეს ფრომისი ისე რომ რეჯექთის და რესოლვის შემთხვევაშიც გამოიტანოს ის მნიშვნელობები რაც ფრომისმა გამოგვატანა

const name = "giorgi";

const promise = new Promise((resolve, reject) => {
  if (name[0] === "a" || name[0] === "g") {
    resolve(name);
  } else {
    reject("error");
  }
});

promise.then(
  (result) => {
    console.log(result);
  },
  (error) => {
    console.log(error);
  },
);
