// 8)შექმენი ფუქნცია რომელსაც გადაეცემა არგუმენტად სია,სადაც მოთავსებული იქნება განსხვავებული მონაცემთა ტიპის ელემენტები,შენი დავალეაბა რომ --> დაითვალო ამ სიაში სტრინგ ტიპის მონაცემების რაოდენობა და ინტეჯერ ტიპის მონაცემების ჯამი, ანუ სიაში უდნა დათვალო რამდენი სტრინგია,და ინტეჯერის შემთხვევაში უნდა გაიგო სიაში მყოფი ინტეჯერების(ნამბერების) ჯამი

function count(arr) {
  let intSum = 0;
  let strSum = 0;
  for (let i = 0; i < arr.length; i++) {
    if (typeof arr[i] == "string") {
      strSum++;
    } else if (typeof arr[i] == "number") {
      intSum += arr[i];
    }
  }
  console.log(intSum);
  console.log(strSum);
}

count([34, 562, 3, 355, 4, 54, "asda", "sda", "dfg", "gdfg"]);

