// 1) Block Scope: ცვლადი ხელმისაწვდომია მხოლოდ იმ { } ბლოკში, სადაც შეიქმნა (მაგ. if, for).

// 2) Global Scope: ცვლადი ხელმისაწვდომია ყველგან, მთელი კოდის განმავლობაში.

// 3) Local Variables: ფუნქციის ან ბლოკის შიგნით შექმნილი ცვლადები. ისინი "ცოცხლობენ" მხოლოდ იქ.

// 4) Global Variables: ნებისმიერი ფუნქციის გარეთ შექმნილი ცვლადები. ისინი ყველასთვის ხილულია.

// 5) Namespace: "კონტეინერი" სახელებისთვის, რომელიც გვეხმარება თავიდან ავიცილოთ სხვადასხვა ცვლადის ერთმანეთში არევა.

// 6) Scope Pollution: როცა Global Scope-ში ბევრი ზედმეტი ცვლადია, რაც ზრდის შეცდომების და სახელების დამთხვევის რისკს.