# Boss Level: გახსენით მაღაზია სახელად PC Parts, სადაც შეგიძლიათ შეიძინოთ სხვადასხვა კომპიუტერული ნაწილი მაგალითად: პროცესორები, ვიდეო ბარათები, ოპერატიული მეხსიერება, კვების ბლოკები, კორპუსები და სხვა. თითოეულ პროდუქტს მიანიჭეთ შესაბამისი ფასი. საბოლოოდ, დაპრინტეთ ჩეკი, სადაც ჩამოთვლილი იქნება შეძენილი ნივთები და ჯამური თანხა. 

pc_parts = {
    "პროცესორი Intel i5": 450,
    "პროცესორი AMD Ryzen 5": 400,
    "ვიდეო ბარათი NVIDIA RTX 3060": 700,
    "ვიდეო ბარათი AMD RX 6700": 650,
    "ოპერატიული მეხსიერება 16GB DDR4": 80,
    "ოპერატიული მეხსიერება 32GB DDR4": 140,
    "კვების ბლოკი 650W": 100,
    "კვების ბლოკი 850W": 150,
    "კორპუსი ATX": 90,
    "SSD 1TB NVMe": 120,
    "SSD 512GB SATA": 60,
    "HDD 2TB": 70,
}

print("მოგესალმებით 'PC Parts' მაღაზიაში")
print("აირჩიეთ პროდუქტები შემდეგი სიიდან:\n")


for part, price in pc_parts.items():
    print(f"{part} - {price} ლარი")

print(" შეყვანეთ პროდუქტის სახელი ზუსტად ან დაწერეთ 'stop' ყიდვის დასასრულებლად.")

cart = []

while True:
    choice = input("\nშეიყვანეთ პროდუქტის სახელი: ")
    if choice.lower() == "stop":  
        break
    elif choice in pc_parts:
        cart.append(choice)
        print(f"{choice} დამატებულია კალათაში.")
    else:
        print("პროდუქტი ვერ მოიძებნა სცადეთ ხელახლა.")

if cart:
    print("\n--- თქვენი ჩეკი ---")
    total = 0
    for item in cart:
        price = pc_parts[item]
        total += price
        print(f"{item} - {price} ლარი")
    print("--------------------")
    print(f"ჯამური თანხა: {total} ლარი")
else:
    print("თქვენ არაფერი შეგიძენიათ.")
